RosimarSilva/UsbReceiver/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t Led6_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA4 (pin 26)  */
    GPIO_PinInit(BOARD_INITPINS_Led6_GPIO, BOARD_INITPINS_Led6_PIN, &Led6_config);

    gpio_pin_config_t Led5_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA13 (pin 29)  */
    GPIO_PinInit(BOARD_INITPINS_Led5_GPIO, BOARD_INITPINS_Led5_PIN, &Led5_config);

    gpio_pin_config_t Led4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB16 (pin 39)  */
    GPIO_PinInit(BOARD_INITPINS_Led4_GPIO, BOARD_INITPINS_Led4_PIN, &Led4_config);

    gpio_pin_config_t rele_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB17 (pin 40)  */
    GPIO_PinInit(BOARD_INITPINS_rele_GPIO, BOARD_INITPINS_rele_PIN, &rele_config);

    gpio_pin_config_t Ds4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB18 (pin 41)  */
    GPIO_PinInit(BOARD_INITPINS_Ds4_GPIO, BOARD_INITPINS_Ds4_PIN, &Ds4_config);

    gpio_pin_config_t Ds3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB19 (pin 42)  */
    GPIO_PinInit(BOARD_INITPINS_Ds3_GPIO, BOARD_INITPINS_Ds3_PIN, &Ds3_config);

    gpio_pin_config_t Ds2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC0 (pin 43)  */
    GPIO_PinInit(BOARD_INITPINS_Ds2_GPIO, BOARD_INITPINS_Ds2_PIN, &Ds2_config);

    gpio_pin_config_t Ds1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC1 (pin 44)  */
    GPIO_PinInit(BOARD_INITPINS_Ds1_GPIO, BOARD_INITPINS_Ds1_PIN, &Ds1_config);

    gpio_pin_config_t Sw3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC2 (pin 45)  */
    GPIO_PinInit(BOARD_INITPINS_Sw3_GPIO, BOARD_INITPINS_Sw3_PIN, &Sw3_config);

    gpio_pin_config_t Sw2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC3 (pin 46)  */
    GPIO_PinInit(BOARD_INITPINS_Sw2_GPIO, BOARD_INITPINS_Sw2_PIN, &Sw2_config);

    gpio_pin_config_t Led3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC7 (pin 56)  */
    GPIO_PinInit(BOARD_INITPINS_Led3_GPIO, BOARD_INITPINS_Led3_PIN, &Led3_config);

    gpio_pin_config_t Led2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD0 (pin 57)  */
    GPIO_PinInit(BOARD_INITPINS_Led2_GPIO, BOARD_INITPINS_Led2_PIN, &Led2_config);

    gpio_pin_config_t Led1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD1 (pin 58)  */
    GPIO_PinInit(BOARD_INITPINS_Led1_GPIO, BOARD_INITPINS_Led1_PIN, &Led1_config);

    gpio_pin_config_t Wc_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE29 (pin 17)  */
    GPIO_PinInit(BOARD_INITPINS_Wc_GPIO, BOARD_INITPINS_Wc_PIN, &Wc_config);

    gpio_pin_config_t Usb_On_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTE31 (pin 19)  */
    GPIO_PinInit(BOARD_INITPINS_Usb_On_GPIO, BOARD_INITPINS_Usb_On_PIN, &Usb_On_config);

    /* PORTA13 (pin 29) is configured as PTA13 */
    PORT_SetPinMux(BOARD_INITPINS_Led5_PORT, BOARD_INITPINS_Led5_PIN, kPORT_MuxAsGpio);

    PORTA->PCR[13] = ((PORTA->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Enable: Internal pullup or pulldown resistor is enabled on the corresponding pin. */
                      | (uint32_t)(PORT_PCR_PE_MASK));

    /* PORTA4 (pin 26) is configured as PTA4 */
    PORT_SetPinMux(BOARD_INITPINS_Led6_PORT, BOARD_INITPINS_Led6_PIN, kPORT_MuxAsGpio);

    PORTA->PCR[4] = ((PORTA->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Enable: Internal pullup or pulldown resistor is enabled on the corresponding pin. */
                     | (uint32_t)(PORT_PCR_PE_MASK));

    /* PORTB0 (pin 35) is configured as ADC0_SE8 */
    PORT_SetPinMux(PORTB, 0U, kPORT_PinDisabledOrAnalog);

    /* PORTB16 (pin 39) is configured as PTB16 */
    PORT_SetPinMux(BOARD_INITPINS_Led4_PORT, BOARD_INITPINS_Led4_PIN, kPORT_MuxAsGpio);

    PORTB->PCR[16] = ((PORTB->PCR[16] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Enable: Internal pullup or pulldown resistor is enabled on the corresponding pin. */
                      | (uint32_t)(PORT_PCR_PE_MASK));

    /* PORTB17 (pin 40) is configured as PTB17 */
    PORT_SetPinMux(BOARD_INITPINS_rele_PORT, BOARD_INITPINS_rele_PIN, kPORT_MuxAsGpio);

    /* PORTB18 (pin 41) is configured as PTB18 */
    PORT_SetPinMux(BOARD_INITPINS_Ds4_PORT, BOARD_INITPINS_Ds4_PIN, kPORT_MuxAsGpio);

    /* PORTB19 (pin 42) is configured as PTB19 */
    PORT_SetPinMux(BOARD_INITPINS_Ds3_PORT, BOARD_INITPINS_Ds3_PIN, kPORT_MuxAsGpio);

    /* PORTC0 (pin 43) is configured as PTC0 */
    PORT_SetPinMux(BOARD_INITPINS_Ds2_PORT, BOARD_INITPINS_Ds2_PIN, kPORT_MuxAsGpio);

    /* PORTC1 (pin 44) is configured as PTC1 */
    PORT_SetPinMux(BOARD_INITPINS_Ds1_PORT, BOARD_INITPINS_Ds1_PIN, kPORT_MuxAsGpio);

    /* PORTC2 (pin 45) is configured as PTC2 */
    PORT_SetPinMux(BOARD_INITPINS_Sw3_PORT, BOARD_INITPINS_Sw3_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC2 (pin 45): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_Sw3_PORT, BOARD_INITPINS_Sw3_PIN, kPORT_InterruptRisingEdge);

    PORTC->PCR[2] = ((PORTC->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

